diary = {'понедельник': {
                          'утро': ['погулять с собакой'],
                          'день': [],
                          'вечер': ['погулять с собакой']
                                      },
        'вторник': {
                          'утро': ['погулять с собакой'],
                          'день': [],
                          'вечер': ['погулять с собакой']
                                      },
        'среда': {
                          'утро': ['погулять с собакой'],
                          'день': [],
                          'вечер': ['погулять с собакой']
                                      },
        'четверг': {
                          'утро': ['погулять с собакой'],
                          'день': [],
                          'вечер': ['погулять с собакой']
                                      },
        'пятница': {
                          'утро': ['заехать в шиномонтаж', 'помыть машину'],
                          'день': [],
                          'вечер': ['поход в театр',  'ужин в кафе']
                                      },
        'суббота': {
                          'утро': [],
                          'день': [],
                          'вечер': []
                                      },
        'воскресенье': {
                          'утро': [],
                          'день': [],
                          'вечер': []
                                      }}

# diary.pop('суббота')
# diary.pop('воскресенье')
# diary.update({('суббота', 'воскресенье'): ['посадить цветы на даче']})
# print(diary)

# diary = {'вторник': {
#     'утро': ['погулять с собакой'],
#     'день': [],
#     'вечер': ['погулять с собакой']
# },

# diary['вторник']['утро'].append('сходить к зубному')
# diary['пятница']['вечер'][0] = 'поход в кино'
# del diary['четверг']['утро'][0]
# del diary['четверг']['вечер'][0]
# print(diary['четверг'])

print(diary['пятница']['утро'][1])